//=============================================================================
/*!	@file	endian.h
	@brief	エンディアン

	@author	ryunosuke ide
	@date	2013.12.08
*/
//=============================================================================

#ifndef NK_ENDIAN_H
#define NK_ENDIAN_H


namespace nk {


enum ENDIAN_TYPE {
	BIG_ENDIAN,		//!< ビッグエンディアン
	LITTLE_ENDIAN,	//!< リトルエンディアン
	
	UNKNOWN_ENDIAN,	//!< エラー
};


//===========================================================================
/*!	@brief		エンディアン処理初期化
*/
//===========================================================================
void		InitializeEndian();

//===========================================================================
/*!	@brief		エンディアンタイプを取得
*/
//===========================================================================
ENDIAN_TYPE	GetEndian();
	
}	// namespace nk


#endif  // NK_ENDIAN_H